results/unused/fabio-4k/002_fio/cmd_264.output
libaio-reference: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666734247,
  "timestamp_ms" : 1666734247308,
  "time" : "Tue Oct 25 23:44:07 2022",
  "jobs" : [
    {
      "jobname" : "libaio-reference",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "libaio-reference",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "4",
        "bs" : "4K",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "libaio",
        "filename" : "/dev/nvme0n1"
      },
      "read" : {
        "io_bytes" : 5208461312,
        "io_kbytes" : 5086388,
        "bw_bytes" : 743959621,
        "bw" : 726523,
        "iops" : 181630.195686,
        "runtime" : 7001,
        "total_ios" : 1271593,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1994,
          "max" : 27552,
          "mean" : 2273.459399,
          "stddev" : 184.930489,
          "N" : 1271594
        },
        "clat_ns" : {
          "min" : 6773,
          "max" : 133701,
          "mean" : 19356.888477,
          "stddev" : 6100.168271,
          "N" : 1271596,
          "percentile" : {
            "1.000000" : 14400,
            "5.000000" : 14528,
            "10.000000" : 14656,
            "20.000000" : 14784,
            "30.000000" : 15168,
            "40.000000" : 15424,
            "50.000000" : 18560,
            "60.000000" : 21120,
            "70.000000" : 21120,
            "80.000000" : 21376,
            "90.000000" : 21888,
            "95.000000" : 30848,
            "99.000000" : 42240,
            "99.500000" : 47360,
            "99.900000" : 77312,
            "99.950000" : 91648,
            "99.990000" : 104960
          }
        },
        "lat_ns" : {
          "min" : 11512,
          "max" : 135855,
          "mean" : 21630.347846,
          "stddev" : 6127.066883,
          "N" : 1271596
        },
        "bw_min" : 724216,
        "bw_max" : 728976,
        "bw_agg" : 100.000000,
        "bw_mean" : 726728.285714,
        "bw_dev" : 1331.121877,
        "bw_samples" : 14,
        "iops_min" : 181054,
        "iops_max" : 182244,
        "iops_mean" : 181682.071429,
        "iops_stddev" : 332.780469,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 21.585714,
      "sys_cpu" : 48.000000,
      "ctx" : 330200,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 50.625082,
        "50" : 49.125703,
        "100" : 0.219253,
        "250" : 0.023750,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "nvme0n1",
      "read_ios" : 1806255,
      "write_ios" : 0,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 26402,
      "write_ticks" : 0,
      "in_queue" : 26402,
      "util" : 99.078934
    }
  ]
}

libaio-reference: (groupid=0, jobs=1): err= 0: pid=88195: Tue Oct 25 23:44:07 2022
  read: IOPS=182k, BW=709MiB/s (744MB/s)(4967MiB/7001msec)
    slat (nsec): min=1994, max=27552, avg=2273.46, stdev=184.93
    clat (usec): min=6, max=133, avg=19.36, stdev= 6.10
     lat (usec): min=11, max=135, avg=21.63, stdev= 6.13
    clat percentiles (usec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   16], 40.00th=[   16], 50.00th=[   19], 60.00th=[   22],
     | 70.00th=[   22], 80.00th=[   22], 90.00th=[   22], 95.00th=[   31],
     | 99.00th=[   43], 99.50th=[   48], 99.90th=[   78], 99.95th=[   92],
     | 99.99th=[  105]
   bw (  KiB/s): min=724216, max=728976, per=100.00%, avg=726728.29, stdev=1331.12, samples=14
   iops        : min=181054, max=182244, avg=181682.07, stdev=332.78, samples=14
  lat (usec)   : 10=0.01%, 20=50.63%, 50=49.13%, 100=0.22%, 250=0.02%
  cpu          : usr=21.59%, sys=48.00%, ctx=330200, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1271593,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=709MiB/s (744MB/s), 709MiB/s-709MiB/s (744MB/s-744MB/s), io=4967MiB (5208MB), run=7001-7001msec

Disk stats (read/write):
  nvme0n1: ios=1806255/0, merge=0/0, ticks=26402/0, in_queue=26402, util=99.08%